## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                    |
|--------|--------------------------------------------|
| add    | `aws_cloudwatch_log_group.logs_exports[0]` |
|        | `aws_rds_cluster_parameter_group.pgaudit`  |
| update | `aws_rds_cluster.notification-canada-ca`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.logs_exports[0] will be created
  + resource "aws_cloudwatch_log_group" "logs_exports" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/cluster/notification-canada-ca-staging-cluster/postgresql"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # aws_rds_cluster.notification-canada-ca will be updated in-place
  ~ resource "aws_rds_cluster" "notification-canada-ca" {
      ~ db_cluster_parameter_group_name     = "rds-cluster-pg" -> "rds-cluster-pg-audit"
      ~ enabled_cloudwatch_logs_exports     = [
          + "postgresql",
        ]
        id                                  = "notification-canada-ca-staging-cluster"
        tags                                = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (38 unchanged attributes hidden)
    }

  # aws_rds_cluster_parameter_group.pgaudit will be created
  + resource "aws_rds_cluster_parameter_group" "pgaudit" {
      + arn         = (known after apply)
      + description = "RDS customized cluster parameter group that enables pgAudit"
      + family      = "aurora-postgresql15"
      + id          = (known after apply)
      + name        = "rds-cluster-pg-audit"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_disconnections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_error_statement"
          + value        = "NOTICE"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "pgaudit.log"
          + value        = "read,role,write,ddl"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.log_retention_period"
          + value        = "1440"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "rds.logical_replication"
          + value        = "1"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pgaudit,pg_stat_statements"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.pgaudit"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

36 tests, 19 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
